# PointElementReference Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointElementReference Class
Members See Also
---
Base class for objects defining a way to constrain a ReferencePoint to one or more other objects in a document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class PointElementReference
```

Visual Basic
---
```text
Public MustInherit Class PointElementReference
```

Visual C++
---
```text
public ref class PointElementReference abstract
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..PointElementReference Autodesk.Revit.DB..::..PointOnEdge Autodesk.Revit.DB..::..PointOnEdgeEdgeIntersection Autodesk.Revit.DB..::..PointOnEdgeFaceIntersection Autodesk.Revit.DB..::..PointOnFace Autodesk.Revit.DB..::..PointOnPlane Autodesk.Revit.DB..::..PointRelativeToPoint
# See Also
PointElementReference Members
Autodesk.Revit.DB Namespace